app/controllers/bookmarks_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @bookmark = Bookmark.new
    @list = List.find(params[:list_id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("comment", "movie_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "sbhasbhjbhj"], ["movie_id", 2], ["list_id", 1], ["created_at", "2021-08-20 14:41:48.383517"], ["updated_at", "2021-08-20 14:41:48.383517"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)
    @list = List.find(params[:list_id])
    @bookmark.list = @list
    if @bookmark.save

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 65]]
---
  def destroy
    @bookmark = Bookmark.find(params[:id])
    @bookmark.destroy