app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "cjkdshds"], ["created_at", "2021-08-20 14:41:13.391737"], ["updated_at", "2021-08-20 14:41:13.391737"]]
---
  def create
    @list = List.new(list_params)
    if @list.save